Table of Contents
 Class Region2D
Namespace
IdeaRS.OpenModel.Geometry2D
Assembly
IdeaRS.OpenModel.dll
Represents a region in two-dimensional space included outline (border) and openings.
[OpenModelClass("CI.Geometry2D.Region2D,CI.Geometry2D")]
[DataContract]
public class Region2D : OpenObject
Inheritance
object
OpenObject
Region2D
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 Region2D()
Constructor
public Region2D()
Properties
 Openings
Gets or sets the list of openings in the Region2D.
[DataMember]
public List<PolyLine2D> Openings { get; set; }
Property Value
List<PolyLine2D>
 Outline
Gets or sets the outline curve of Region2D.
[DataMember]
public PolyLine2D Outline { get; set; }
Property Value
PolyLine2D
 Edit this page